todo2/app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["title", "hi"], ["body", "bye"], ["updated_at", "2021-08-26 20:25:42.145497"], ["id", 3]]
---
    def update
        @todo = Todo.find(params[:id])
        if @todo.update(todo_params)